# DeletingBadFamType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..DeletingBadFamType Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Can't make type "[Family Name]". It will be deleted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DeletingBadFamType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DeletingBadFamType As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DeletingBadFamType {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace